<template>
  <section class="about-intro">
    <h1>안녕하세요. 게으르지만 꾸준한 개발자 김성찬 (Sckroll) 입니다.</h1>
    웹 프론트엔드(Front-end) 개발자가 되고자 끊임없이 공부하는 20대입니다. 학부
    과제로 웹 사이트를 만드는 과정에서 PC나 모바일에 상관없이 웹을 통해 동일한
    서비스를 사용자에게 제공할 수 있다는 점이 매력적으로 다가왔습니다. 특히
    사용자가 직접 볼 수 있고 소통할 수 있는 프론트엔드 부분이 마음에 들었고,
    제가 원하는 대로 화면을 디자인하는 것이 재미있었기 때문에 진로를
    프론트엔드로 결정하게 되었습니다. 목표는 정했지만 직접 실행에 옮기지 않는 제
    단점을 고치기 위해 2020년 12월 말부터 1일 1커밋 운동에 동참하기 시작했고,
    지금도 꾸준히 유지하고 있습니다. 당장은 프론트엔드 개발자를 지향하지만,
    백엔드 기술에도 관심이 있어서 서버와 API를 구성하고 웹 앱을 클라우드로
    배포해본 경험이 있습니다. 장기적으로는 프론트엔드와 백엔드를 아우르는 풀스택
    개발자가 되어 많은 사람들이 사용하는 서비스 개발에 주도적으로 기여하고
    싶습니다. 현재 SSAFY 7기에 입과하여 공부 겸 취업 준비 중에 있습니다.
  </section>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped>
section {
}
</style>
