<template>
  <section class="about-content">
    <h1>Q&A</h1>
    <h2>닉네임의 유래</h2>
    <p>
      제 이니셜(SCK, SeongChan Kim)과 Scroll의 합성어입니다. 처음 닉네임을 지을
      때 제 이름의 이니셜이 들어가야 한다는 것을 전제로 지었는데, 적절한 단어를
      찾다 보니 어감도 괜찮고, 웹 서핑을 할 때 필수적인 동작 중 하나인
      '스크롤'과 발음이 같은 것이 마치 저의 주요 개발 도메인인 '웹'을 상징하는
      듯해서 자연스럽게 지금의 닉네임이 되었습니다. 게다가 Sckroll의
      roll(구르다, 돌다)은 정적이 아닌 동적인 상태를 의미하는데, 수동적이 아닌
      능동적인 자세를 지향하는, 즉 정적으로 현재에 안주하지 않고 동적으로
      끊임없이 발전하겠다는 제 의지를 담고 있습니다.
    </p>
    <h2>MBTI는?</h2>
    <p>INTP였다가 최근에는 ISTP가 되었습니다.</p>
  </section>
</template>
