<template>
  <section class="about-content">
    <h1>
      웹 프론트엔드(Frontend) 개발자가 되고자 끊임없이 공부하는 20대입니다.
    </h1>
    <p>유지보수하기 쉬운 코드와 웹 기술, 그리고 디자인에 관심이 많습니다.</p>
    <p>
      대학 졸업작품으로 웹 애플리케이션을 만드는 과정에서 기기의 종류나 스펙에
      상관없이 동일한 컨텐츠를 접할 수 있다는 점이 매력적으로 다가왔습니다. 특히
      사용자가 직접 볼 수 있고 소통할 수 있는 프론트엔드가 마음에 들었고, 제가
      원하는 대로 화면을 디자인하는 것이 재미있었기 때문에 프론트엔드 개발자를
      목표로 공부하기 시작했습니다.
    </p>
    <p>
      피그마로 UI를 구상 & 디자인하고 이를 실제 코드로 구현하는 과정에 자신이
      있습니다. 단순히 즐겨만 하는 게 아니라 어떻게 설계하면 사용자 입장에서
      불편하지 않을지 고민하곤 합니다. 그리고 컴포넌트를 구현하는 과정에서 무슨
      의도로 로직을 구성했는지, "왜" 이런 기술 스택을 사용해야 하는지 논리적으로
      설명할 줄 아는 개발자가 되고자 노력하고 있습니다.
    </p>
    <p>
      현재 삼성 청년 SW 아카데미(SSAFY)에 입학 후 다양한 경험을 쌓으면서 취업을
      준비하고 있습니다.
    </p>
  </section>
</template>
